## Terraform Plan for Staging Environment

**Environment**: Staging
**Branch**: develop
**Triggered by**: PR #57
  
  <details><summary>Click to expand plan</summary>
  
  ```hcl
  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.blue_asg.data.template_file.user_data will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "user_data" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<-EOT
            #!/bin/bash
            
            # Update system packages
            yum update -y
            
            # Install required packages
            yum install -y python3 python3-pip git mariadb1011-client-utils jq
            
            # Create application directory
            mkdir -p /var/www/webapp
            cd /var/www/webapp
            
            # Create Python virtual environment
            python3 -m venv venv
            source venv/bin/activate
            
            # Install required Python packages
            pip install flask mysql-connector-python requests psutil
            
            # Create enhanced application files
            cat > app.py << 'EOF'
            from flask import Flask, jsonify, request
            import mysql.connector
            import os
            import psutil
            import time
            from datetime import datetime
            import requests
            
            app = Flask(__name__)
            
            # Database configuration
            db_config = {
                'host': '${db_host}',
                'user': '${db_user}',
                'password': '${db_password}',
                'database': '${db_name}'
            }
            
            def get_db_connection():
                return mysql.connector.connect(**db_config)
            
            def check_database_connection():
                """Check if database connection is working"""
                try:
                    conn = get_db_connection()
                    cursor = conn.cursor()
                    cursor.execute('SELECT 1')
                    cursor.fetchone()
                    cursor.close()
                    conn.close()
                    return True
                except Exception as e:
                    print(f"Database connection failed: {e}")
                    return False
            
            def check_application_readiness():
                """Check if application is ready to serve requests"""
                try:
                    # Just check if database is responding, don't check for specific data
                    conn = get_db_connection()
                    cursor = conn.cursor()
                    cursor.execute('SELECT 1')  # Simple connectivity test
                    cursor.fetchone()
                    cursor.close()
                    conn.close()
                    return True  # If we can connect and execute a query, we're ready
                except Exception as e:
                    print(f"Application readiness check failed: {e}")
                    return False
            
            def check_memory_usage():
                """Check if memory usage is within acceptable limits"""
                memory = psutil.virtual_memory()
                return memory.percent < 90  # Less than 90% memory usage
            
            def check_disk_space():
                """Check if disk space is sufficient"""
                disk = psutil.disk_usage('/')
                return disk.percent < 90  # Less than 90% disk usage
            
            def check_response_times():
                """Check if application response times are acceptable"""
                try:
                    start_time = time.time()
                    conn = get_db_connection()
                    cursor = conn.cursor()
                    cursor.execute('SELECT 1')
                    cursor.fetchone()
                    cursor.close()
                    conn.close()
                    response_time = time.time() - start_time
                    return response_time < 2.0  # Less than 2 seconds
                except Exception:
                    return False
            
            @app.route('/')
            def index():
                try:
                    conn = get_db_connection()
                    cursor = conn.cursor(dictionary=True)
                    cursor.execute('SELECT * FROM contacts')
                    contacts = cursor.fetchall()
                    cursor.close()
                    conn.close()
                    return jsonify({
                        'contacts': contacts,
                        'deployment_color': '${deployment_color}',
                        'timestamp': datetime.utcnow().isoformat(),
                        'instance_id': os.environ.get('INSTANCE_ID', 'unknown')
                    })
                except Exception as e:
                    return jsonify({'error': str(e)}), 500
            
            @app.route('/health')
            def health():
                """Enhanced health check endpoint"""
                try:
                    # Database connectivity check
                    db_status = check_database_connection()
                    
                    # Application readiness check
                    app_status = check_application_readiness()
                    
                    # System health checks
                    memory_status = check_memory_usage()
                    disk_status = check_disk_space()
                    response_status = check_response_times()
                    
                    # Overall health status
                    all_healthy = all([db_status, app_status, memory_status, disk_status, response_status])
                    
                    return jsonify({
                        'status': 'healthy' if all_healthy else 'unhealthy',
                        'checks': {
                            'database_connectivity': db_status,
                            'application_readiness': app_status,
                            'memory_usage': memory_status,
                            'disk_space': disk_status,
                            'response_times': response_status
                        },
                        'deployment_color': '${deployment_color}',
                        'timestamp': datetime.utcnow().isoformat(),
                        'instance_id': os.environ.get('INSTANCE_ID', 'unknown')
                    }), 200 if all_healthy else 503
                except Exception as e:
                    return jsonify({
                        'status': 'unhealthy',
                        'error': str(e),
                        'deployment_color': '${deployment_color}',
                        'timestamp': datetime.utcnow().isoformat()
                    }), 500
            
            @app.route('/health/simple')
            def health_simple():
                """Simple health check for load balancer target groups"""
                try:
                    # Basic application check - just verify the app is running
                    # Don't check database or other services to keep it simple and fast
                    return jsonify({
                        'status': 'healthy',
                        'deployment_color': '${deployment_color}',
                        'timestamp': datetime.utcnow().isoformat(),
                        'instance_id': os.environ.get('INSTANCE_ID', 'unknown'),
                        'message': 'Application is running'
                    }), 200
                except Exception as e:
                    return jsonify({
                        'status': 'unhealthy',
                        'error': str(e),
                        'deployment_color': '${deployment_color}',
                        'timestamp': datetime.utcnow().isoformat(),
                        'instance_id': os.environ.get('INSTANCE_ID', 'unknown')
                    }), 500
            
            @app.route('/deployment/validate')
            def deployment_validation():
                """Comprehensive validation for new deployments"""
                try:
                    checks = {
                        'database_connectivity': check_database_connection(),
                        'application_functionality': check_application_readiness(),
                        'memory_usage': check_memory_usage(),
                        'disk_space': check_disk_space(),
                        'response_times': check_response_times()
                    }
                    
                    all_passed = all(checks.values())
                    
                    return jsonify({
                        'deployment_ready': all_passed,
                        'checks': checks,
                        'deployment_color': '${deployment_color}',
                        'timestamp': datetime.utcnow().isoformat(),
                        'instance_id': os.environ.get('INSTANCE_ID', 'unknown')
                    }), 200 if all_passed else 503
                except Exception as e:
                    return jsonify({
                        'deployment_ready': False,
                        'error': str(e),
                        'deployment_color': '${deployment_color}',
                        'timestamp': datetime.utcnow().isoformat()
                    }), 500
            
            @app.route('/info')
            def info():
                """Instance information endpoint"""
                try:
                    memory = psutil.virtual_memory()
                    disk = psutil.disk_usage('/')
                    
                    return jsonify({
                        'deployment_color': '${deployment_color}',
                        'instance_id': os.environ.get('INSTANCE_ID', 'unknown'),
                        'system_info': {
                            'memory_usage_percent': memory.percent,
                            'disk_usage_percent': disk.percent,
                            'cpu_count': psutil.cpu_count(),
                            'uptime': time.time() - psutil.boot_time()
                        },
                        'timestamp': datetime.utcnow().isoformat()
                    })
                except Exception as e:
                    return jsonify({'error': str(e)}), 500
            
            if __name__ == '__main__':
                app.run(host='0.0.0.0', port=8080)
            EOF
            
            # Create systemd service file
            cat > /etc/systemd/system/webapp.service << 'EOF'
            [Unit]
            Description=Python Web Application
            After=network.target
            
            [Service]
            User=root
            WorkingDirectory=/var/www/webapp
            Environment="PATH=/var/www/webapp/venv/bin"
            Environment="INSTANCE_ID=$(curl -s http://169.254.169.254/latest/meta-data/instance-id)"
            ExecStart=/var/www/webapp/venv/bin/python app.py
            Restart=always
            RestartSec=10
            
            [Install]
            WantedBy=multi-user.target
            EOF
            
            # Start and enable the service
            systemctl daemon-reload
            systemctl start webapp
            systemctl enable webapp
            
            # Wait for the application to start up
            echo "Waiting for application to start up..." >> /var/log/webapp-deployment.log
            sleep 30
            
            # Verify the application is running
            for i in {1..10}; do
                if curl -f http://localhost:8080/health/simple > /dev/null 2>&1; then
                    echo "Application is running and responding to health checks" >> /var/log/webapp-deployment.log
                    break
                else
                    echo "Attempt $i: Application not yet ready, waiting..." >> /var/log/webapp-deployment.log
                    sleep 10
                fi
            done
            
            # Create a simple health check script
            cat > /usr/local/bin/health-check.sh << 'EOF'
            #!/bin/bash
            curl -f http://localhost:8080/health > /dev/null 2>&1
            exit $?
            EOF
            
            chmod +x /usr/local/bin/health-check.sh
            
            # Log deployment information
            echo "Deployment completed for ${deployment_color} environment at $(date)" >> /var/log/webapp-deployment.log
            echo "Instance ID: $(curl -s http://169.254.169.254/latest/meta-data/instance-id)" >> /var/log/webapp-deployment.log
            echo "Deployment Color: ${deployment_color}" >> /var/log/webapp-deployment.log
            echo "Application startup sequence completed" >> /var/log/webapp-deployment.log
        EOT
      + vars     = {
          + "db_host"          = (known after apply)
          + "db_name"          = "tfplayground"
          + "db_password"      = (sensitive value)
          + "db_user"          = (sensitive value)
          + "deployment_color" = "blue"
        }
    }

  # module.blue_asg.aws_autoscaling_group.asg will be created
  + resource "aws_autoscaling_group" "asg" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = 1
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = "ELB"
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_size                         = 1
      + metrics_granularity              = "1Minute"
      + min_size                         = 1
      + name                             = "staging-blue-asg"
      + name_prefix                      = (known after apply)
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = (known after apply)
      + vpc_zone_identifier              = (known after apply)
      + wait_for_capacity_timeout        = "10m"
      + warm_pool_size                   = (known after apply)

      + availability_zone_distribution (known after apply)

      + capacity_reservation_specification (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = "$Latest"
        }

      + mixed_instances_policy (known after apply)

      + tag {
          + key                 = "DeploymentColor"
          + propagate_at_launch = true
          + value               = "blue"
        }
      + tag {
          + key                 = "Environment"
          + propagate_at_launch = true
          + value               = "staging"
        }
      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "staging-blue-asg"
        }

      + traffic_source (known after apply)
    }

  # module.blue_asg.aws_iam_instance_profile.asg will be created
  + resource "aws_iam_instance_profile" "asg" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "staging-blue-asg-profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "staging-blue-asg-role"
      + tags_all    = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
        }
      + unique_id   = (known after apply)
    }

  # module.blue_asg.aws_iam_policy.asg_rds will be created
  + resource "aws_iam_policy" "asg_rds" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy to allow ASG instances to interact with RDS database"
      + id               = (known after apply)
      + name             = "staging-blue-asg-rds-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "rds-db:connect",
                          + "rds:DescribeDBInstances",
                          + "rds:DescribeDBClusters",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:rds:us-east-2:123324351829:db:staging-*",
                          + "arn:aws:rds-db:us-east-2:123324351829:dbuser:staging-*/*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "Name" = "staging-blue-asg-rds-policy"
        }
      + tags_all         = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-blue-asg-rds-policy"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
        }
    }

  # module.blue_asg.aws_iam_policy.asg_secrets will be created
  + resource "aws_iam_policy" "asg_secrets" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy to allow ASG instances to access database credentials in Secrets Manager"
      + id               = (known after apply)
      + name             = "staging-blue-asg-secrets-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "secretsmanager:GetSecretValue",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:secretsmanager:us-east-2:123324351829:secret:/tf-playground/staging/database/credentials-*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "Name" = "staging-blue-asg-secrets-policy"
        }
      + tags_all         = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-blue-asg-secrets-policy"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
        }
    }

  # module.blue_asg.aws_iam_role.asg will be created
  + resource "aws_iam_role" "asg" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "staging-blue-asg-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "staging-blue-asg-role"
        }
      + tags_all              = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-blue-asg-role"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.blue_asg.aws_iam_role_policy_attachment.asg_rds will be created
  + resource "aws_iam_role_policy_attachment" "asg_rds" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "staging-blue-asg-role"
    }

  # module.blue_asg.aws_iam_role_policy_attachment.asg_secrets will be created
  + resource "aws_iam_role_policy_attachment" "asg_secrets" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "staging-blue-asg-role"
    }

  # module.blue_asg.aws_iam_role_policy_attachment.asg_ssm will be created
  + resource "aws_iam_role_policy_attachment" "asg_ssm" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "staging-blue-asg-role"
    }

  # module.blue_asg.aws_key_pair.asg will be created
  + resource "aws_key_pair" "asg" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "staging-blue-key"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = (known after apply)
      + tags_all        = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
        }
    }

  # module.blue_asg.aws_launch_template.asg will be created
  + resource "aws_launch_template" "asg" {
      + arn             = (known after apply)
      + default_version = (known after apply)
      + id              = (known after apply)
      + image_id        = "ami-06c8f2ec674c67112"
      + instance_type   = "t3.micro"
      + key_name        = "staging-blue-key"
      + latest_version  = (known after apply)
      + name            = (known after apply)
      + name_prefix     = "staging-blue-lt"
      + tags            = {
          + "Name" = "staging-blue-launch-template"
        }
      + tags_all        = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-blue-launch-template"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
        }
      + user_data       = (known after apply)

      + block_device_mappings {
          + device_name = "/dev/xvda"

          + ebs {
              + encrypted                  = "true"
              + iops                       = (known after apply)
              + throughput                 = (known after apply)
              + volume_initialization_rate = (known after apply)
              + volume_size                = 20
              + volume_type                = "gp3"
            }
        }

      + iam_instance_profile {
          + name = "staging-blue-asg-profile"
        }

      + metadata_options (known after apply)

      + network_interfaces {
          + associate_public_ip_address = "true"
          + security_groups             = (known after apply)
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "DeploymentColor" = "blue"
              + "Environment"     = "staging"
              + "Name"            = "staging-blue-instance"
            }
        }
    }

  # module.blue_asg.aws_security_group.asg will be created
  + resource "aws_security_group" "asg" {
      + arn                    = (known after apply)
      + description            = "Security group for blue Auto Scaling Group"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "SSH access"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
          + {
              + cidr_blocks      = []
              + description      = "Allow HTTP traffic from ALB"
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 8080
            },
        ]
      + name                   = "staging-blue-asg-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "staging-blue-asg-sg"
        }
      + tags_all               = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-blue-asg-sg"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
        }
      + vpc_id                 = (known after apply)
    }

  # module.blue_asg.tls_private_key.asg will be created
  + resource "tls_private_key" "asg" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 4096
    }

  # module.database.aws_db_instance.database will be created
  + resource "aws_db_instance" "database" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = 7
      + backup_target                         = (known after apply)
      + backup_window                         = "03:00-04:00"
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + database_insights_mode                = (known after apply)
      + db_name                               = "tfplayground"
      + db_subnet_group_name                  = "staging-db-subnet-group"
      + dedicated_log_volume                  = false
      + delete_automated_backups              = true
      + deletion_protection                   = false
      + domain_fqdn                           = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "mysql"
      + engine_lifecycle_support              = (known after apply)
      + engine_version                        = "8.0"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "staging-db"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = "mon:04:00-mon:05:00"
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = false
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + password_wo                           = (write-only attribute)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = true
      + storage_throughput                    = (known after apply)
      + storage_type                          = "gp3"
      + tags                                  = {
          + "Name" = "staging-database"
        }
      + tags_all                              = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-database"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
        }
      + timezone                              = (known after apply)
      + username                              = "tfplayground_user"
      + vpc_security_group_ids                = (known after apply)
    }

  # module.database.aws_db_subnet_group.database will be created
  + resource "aws_db_subnet_group" "database" {
      + arn                     = (known after apply)
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + name                    = "staging-db-subnet-group"
      + name_prefix             = (known after apply)
      + subnet_ids              = (known after apply)
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Name" = "staging-db-subnet-group"
        }
      + tags_all                = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-db-subnet-group"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
        }
      + vpc_id                  = (known after apply)
    }

  # module.database.aws_security_group.database will be created
  + resource "aws_security_group" "database" {
      + arn                    = (known after apply)
      + description            = "Security group for RDS instance"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "Allow MySQL access from web server security group"
              + from_port        = 3306
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 3306
            },
          + {
              + cidr_blocks      = []
              + description      = "Allow MySQL access from web server security group"
              + from_port        = 3306
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 3306
            },
        ]
      + name                   = "staging-database-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "staging-database-sg"
        }
      + tags_all               = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-database-sg"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
        }
      + vpc_id                 = (known after apply)
    }

  # module.green_asg.data.template_file.user_data will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "user_data" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<-EOT
            #!/bin/bash
            
            # Update system packages
            yum update -y
            
            # Install required packages
            yum install -y python3 python3-pip git mariadb1011-client-utils jq
            
            # Create application directory
            mkdir -p /var/www/webapp
            cd /var/www/webapp
            
            # Create Python virtual environment
            python3 -m venv venv
            source venv/bin/activate
            
            # Install required Python packages
            pip install flask mysql-connector-python requests psutil
            
            # Create enhanced application files
            cat > app.py << 'EOF'
            from flask import Flask, jsonify, request
            import mysql.connector
            import os
            import psutil
            import time
            from datetime import datetime
            import requests
            
            app = Flask(__name__)
            
            # Database configuration
            db_config = {
                'host': '${db_host}',
                'user': '${db_user}',
                'password': '${db_password}',
                'database': '${db_name}'
            }
            
            def get_db_connection():
                return mysql.connector.connect(**db_config)
            
            def check_database_connection():
                """Check if database connection is working"""
                try:
                    conn = get_db_connection()
                    cursor = conn.cursor()
                    cursor.execute('SELECT 1')
                    cursor.fetchone()
                    cursor.close()
                    conn.close()
                    return True
                except Exception as e:
                    print(f"Database connection failed: {e}")
                    return False
            
            def check_application_readiness():
                """Check if application is ready to serve requests"""
                try:
                    # Just check if database is responding, don't check for specific data
                    conn = get_db_connection()
                    cursor = conn.cursor()
                    cursor.execute('SELECT 1')  # Simple connectivity test
                    cursor.fetchone()
                    cursor.close()
                    conn.close()
                    return True  # If we can connect and execute a query, we're ready
                except Exception as e:
                    print(f"Application readiness check failed: {e}")
                    return False
            
            def check_memory_usage():
                """Check if memory usage is within acceptable limits"""
                memory = psutil.virtual_memory()
                return memory.percent < 90  # Less than 90% memory usage
            
            def check_disk_space():
                """Check if disk space is sufficient"""
                disk = psutil.disk_usage('/')
                return disk.percent < 90  # Less than 90% disk usage
            
            def check_response_times():
                """Check if application response times are acceptable"""
                try:
                    start_time = time.time()
                    conn = get_db_connection()
                    cursor = conn.cursor()
                    cursor.execute('SELECT 1')
                    cursor.fetchone()
                    cursor.close()
                    conn.close()
                    response_time = time.time() - start_time
                    return response_time < 2.0  # Less than 2 seconds
                except Exception:
                    return False
            
            @app.route('/')
            def index():
                try:
                    conn = get_db_connection()
                    cursor = conn.cursor(dictionary=True)
                    cursor.execute('SELECT * FROM contacts')
                    contacts = cursor.fetchall()
                    cursor.close()
                    conn.close()
                    return jsonify({
                        'contacts': contacts,
                        'deployment_color': '${deployment_color}',
                        'timestamp': datetime.utcnow().isoformat(),
                        'instance_id': os.environ.get('INSTANCE_ID', 'unknown')
                    })
                except Exception as e:
                    return jsonify({'error': str(e)}), 500
            
            @app.route('/health')
            def health():
                """Enhanced health check endpoint"""
                try:
                    # Database connectivity check
                    db_status = check_database_connection()
                    
                    # Application readiness check
                    app_status = check_application_readiness()
                    
                    # System health checks
                    memory_status = check_memory_usage()
                    disk_status = check_disk_space()
                    response_status = check_response_times()
                    
                    # Overall health status
                    all_healthy = all([db_status, app_status, memory_status, disk_status, response_status])
                    
                    return jsonify({
                        'status': 'healthy' if all_healthy else 'unhealthy',
                        'checks': {
                            'database_connectivity': db_status,
                            'application_readiness': app_status,
                            'memory_usage': memory_status,
                            'disk_space': disk_status,
                            'response_times': response_status
                        },
                        'deployment_color': '${deployment_color}',
                        'timestamp': datetime.utcnow().isoformat(),
                        'instance_id': os.environ.get('INSTANCE_ID', 'unknown')
                    }), 200 if all_healthy else 503
                except Exception as e:
                    return jsonify({
                        'status': 'unhealthy',
                        'error': str(e),
                        'deployment_color': '${deployment_color}',
                        'timestamp': datetime.utcnow().isoformat()
                    }), 500
            
            @app.route('/health/simple')
            def health_simple():
                """Simple health check for load balancer target groups"""
                try:
                    # Basic application check - just verify the app is running
                    # Don't check database or other services to keep it simple and fast
                    return jsonify({
                        'status': 'healthy',
                        'deployment_color': '${deployment_color}',
                        'timestamp': datetime.utcnow().isoformat(),
                        'instance_id': os.environ.get('INSTANCE_ID', 'unknown'),
                        'message': 'Application is running'
                    }), 200
                except Exception as e:
                    return jsonify({
                        'status': 'unhealthy',
                        'error': str(e),
                        'deployment_color': '${deployment_color}',
                        'timestamp': datetime.utcnow().isoformat(),
                        'instance_id': os.environ.get('INSTANCE_ID', 'unknown')
                    }), 500
            
            @app.route('/deployment/validate')
            def deployment_validation():
                """Comprehensive validation for new deployments"""
                try:
                    checks = {
                        'database_connectivity': check_database_connection(),
                        'application_functionality': check_application_readiness(),
                        'memory_usage': check_memory_usage(),
                        'disk_space': check_disk_space(),
                        'response_times': check_response_times()
                    }
                    
                    all_passed = all(checks.values())
                    
                    return jsonify({
                        'deployment_ready': all_passed,
                        'checks': checks,
                        'deployment_color': '${deployment_color}',
                        'timestamp': datetime.utcnow().isoformat(),
                        'instance_id': os.environ.get('INSTANCE_ID', 'unknown')
                    }), 200 if all_passed else 503
                except Exception as e:
                    return jsonify({
                        'deployment_ready': False,
                        'error': str(e),
                        'deployment_color': '${deployment_color}',
                        'timestamp': datetime.utcnow().isoformat()
                    }), 500
            
            @app.route('/info')
            def info():
                """Instance information endpoint"""
                try:
                    memory = psutil.virtual_memory()
                    disk = psutil.disk_usage('/')
                    
                    return jsonify({
                        'deployment_color': '${deployment_color}',
                        'instance_id': os.environ.get('INSTANCE_ID', 'unknown'),
                        'system_info': {
                            'memory_usage_percent': memory.percent,
                            'disk_usage_percent': disk.percent,
                            'cpu_count': psutil.cpu_count(),
                            'uptime': time.time() - psutil.boot_time()
                        },
                        'timestamp': datetime.utcnow().isoformat()
                    })
                except Exception as e:
                    return jsonify({'error': str(e)}), 500
            
            if __name__ == '__main__':
                app.run(host='0.0.0.0', port=8080)
            EOF
            
            # Create systemd service file
            cat > /etc/systemd/system/webapp.service << 'EOF'
            [Unit]
            Description=Python Web Application
            After=network.target
            
            [Service]
            User=root
            WorkingDirectory=/var/www/webapp
            Environment="PATH=/var/www/webapp/venv/bin"
            Environment="INSTANCE_ID=$(curl -s http://169.254.169.254/latest/meta-data/instance-id)"
            ExecStart=/var/www/webapp/venv/bin/python app.py
            Restart=always
            RestartSec=10
            
            [Install]
            WantedBy=multi-user.target
            EOF
            
            # Start and enable the service
            systemctl daemon-reload
            systemctl start webapp
            systemctl enable webapp
            
            # Wait for the application to start up
            echo "Waiting for application to start up..." >> /var/log/webapp-deployment.log
            sleep 30
            
            # Verify the application is running
            for i in {1..10}; do
                if curl -f http://localhost:8080/health/simple > /dev/null 2>&1; then
                    echo "Application is running and responding to health checks" >> /var/log/webapp-deployment.log
                    break
                else
                    echo "Attempt $i: Application not yet ready, waiting..." >> /var/log/webapp-deployment.log
                    sleep 10
                fi
            done
            
            # Create a simple health check script
            cat > /usr/local/bin/health-check.sh << 'EOF'
            #!/bin/bash
            curl -f http://localhost:8080/health > /dev/null 2>&1
            exit $?
            EOF
            
            chmod +x /usr/local/bin/health-check.sh
            
            # Log deployment information
            echo "Deployment completed for ${deployment_color} environment at $(date)" >> /var/log/webapp-deployment.log
            echo "Instance ID: $(curl -s http://169.254.169.254/latest/meta-data/instance-id)" >> /var/log/webapp-deployment.log
            echo "Deployment Color: ${deployment_color}" >> /var/log/webapp-deployment.log
            echo "Application startup sequence completed" >> /var/log/webapp-deployment.log
        EOT
      + vars     = {
          + "db_host"          = (known after apply)
          + "db_name"          = "tfplayground"
          + "db_password"      = (sensitive value)
          + "db_user"          = (sensitive value)
          + "deployment_color" = "green"
        }
    }

  # module.green_asg.aws_autoscaling_group.asg will be created
  + resource "aws_autoscaling_group" "asg" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = 1
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = "ELB"
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_size                         = 1
      + metrics_granularity              = "1Minute"
      + min_size                         = 1
      + name                             = "staging-green-asg"
      + name_prefix                      = (known after apply)
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = (known after apply)
      + vpc_zone_identifier              = (known after apply)
      + wait_for_capacity_timeout        = "10m"
      + warm_pool_size                   = (known after apply)

      + availability_zone_distribution (known after apply)

      + capacity_reservation_specification (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = "$Latest"
        }

      + mixed_instances_policy (known after apply)

      + tag {
          + key                 = "DeploymentColor"
          + propagate_at_launch = true
          + value               = "green"
        }
      + tag {
          + key                 = "Environment"
          + propagate_at_launch = true
          + value               = "staging"
        }
      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "staging-green-asg"
        }

      + traffic_source (known after apply)
    }

  # module.green_asg.aws_iam_instance_profile.asg will be created
  + resource "aws_iam_instance_profile" "asg" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "staging-green-asg-profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "staging-green-asg-role"
      + tags_all    = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
        }
      + unique_id   = (known after apply)
    }

  # module.green_asg.aws_iam_policy.asg_rds will be created
  + resource "aws_iam_policy" "asg_rds" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy to allow ASG instances to interact with RDS database"
      + id               = (known after apply)
      + name             = "staging-green-asg-rds-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "rds-db:connect",
                          + "rds:DescribeDBInstances",
                          + "rds:DescribeDBClusters",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:rds:us-east-2:123324351829:db:staging-*",
                          + "arn:aws:rds-db:us-east-2:123324351829:dbuser:staging-*/*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "Name" = "staging-green-asg-rds-policy"
        }
      + tags_all         = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-green-asg-rds-policy"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
        }
    }

  # module.green_asg.aws_iam_policy.asg_secrets will be created
  + resource "aws_iam_policy" "asg_secrets" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy to allow ASG instances to access database credentials in Secrets Manager"
      + id               = (known after apply)
      + name             = "staging-green-asg-secrets-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "secretsmanager:GetSecretValue",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:secretsmanager:us-east-2:123324351829:secret:/tf-playground/staging/database/credentials-*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "Name" = "staging-green-asg-secrets-policy"
        }
      + tags_all         = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-green-asg-secrets-policy"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
        }
    }

  # module.green_asg.aws_iam_role.asg will be created
  + resource "aws_iam_role" "asg" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "staging-green-asg-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "staging-green-asg-role"
        }
      + tags_all              = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-green-asg-role"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.green_asg.aws_iam_role_policy_attachment.asg_rds will be created
  + resource "aws_iam_role_policy_attachment" "asg_rds" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "staging-green-asg-role"
    }

  # module.green_asg.aws_iam_role_policy_attachment.asg_secrets will be created
  + resource "aws_iam_role_policy_attachment" "asg_secrets" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "staging-green-asg-role"
    }

  # module.green_asg.aws_iam_role_policy_attachment.asg_ssm will be created
  + resource "aws_iam_role_policy_attachment" "asg_ssm" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "staging-green-asg-role"
    }

  # module.green_asg.aws_key_pair.asg will be created
  + resource "aws_key_pair" "asg" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "staging-green-key"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = (known after apply)
      + tags_all        = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
        }
    }

  # module.green_asg.aws_launch_template.asg will be created
  + resource "aws_launch_template" "asg" {
      + arn             = (known after apply)
      + default_version = (known after apply)
      + id              = (known after apply)
      + image_id        = "ami-06c8f2ec674c67112"
      + instance_type   = "t3.micro"
      + key_name        = "staging-green-key"
      + latest_version  = (known after apply)
      + name            = (known after apply)
      + name_prefix     = "staging-green-lt"
      + tags            = {
          + "Name" = "staging-green-launch-template"
        }
      + tags_all        = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-green-launch-template"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
        }
      + user_data       = (known after apply)

      + block_device_mappings {
          + device_name = "/dev/xvda"

          + ebs {
              + encrypted                  = "true"
              + iops                       = (known after apply)
              + throughput                 = (known after apply)
              + volume_initialization_rate = (known after apply)
              + volume_size                = 20
              + volume_type                = "gp3"
            }
        }

      + iam_instance_profile {
          + name = "staging-green-asg-profile"
        }

      + metadata_options (known after apply)

      + network_interfaces {
          + associate_public_ip_address = "true"
          + security_groups             = (known after apply)
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "DeploymentColor" = "green"
              + "Environment"     = "staging"
              + "Name"            = "staging-green-instance"
            }
        }
    }

  # module.green_asg.aws_security_group.asg will be created
  + resource "aws_security_group" "asg" {
      + arn                    = (known after apply)
      + description            = "Security group for green Auto Scaling Group"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "SSH access"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
          + {
              + cidr_blocks      = []
              + description      = "Allow HTTP traffic from ALB"
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 8080
            },
        ]
      + name                   = "staging-green-asg-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "staging-green-asg-sg"
        }
      + tags_all               = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-green-asg-sg"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
        }
      + vpc_id                 = (known after apply)
    }

  # module.green_asg.tls_private_key.asg will be created
  + resource "tls_private_key" "asg" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 4096
    }

  # module.loadbalancer.aws_lb.main will be created
  + resource "aws_lb" "main" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "staging-alb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = (known after apply)
      + tags                                                         = {
          + "Name" = "staging-alb"
        }
      + tags_all                                                     = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-alb"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + subnet_mapping (known after apply)
    }

  # module.loadbalancer.aws_lb_listener.http will be created
  + resource "aws_lb_listener" "http" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags                                                                  = {
          + "Name" = "staging-alb-http-listener"
        }
      + tags_all                                                              = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-alb-http-listener"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + mutual_authentication (known after apply)
    }

  # module.loadbalancer.aws_lb_listener_rule.blue will be created
  + resource "aws_lb_listener_rule" "blue" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 100
      + tags         = {
          + "Name" = "staging-blue-rule"
        }
      + tags_all     = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-blue-rule"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
        }

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "/*",
                ]
            }
        }
    }

  # module.loadbalancer.aws_lb_listener_rule.green will be created
  + resource "aws_lb_listener_rule" "green" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 200
      + tags         = {
          + "Name" = "staging-green-rule"
        }
      + tags_all     = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-green-rule"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
        }

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "/green*",
                  + "/green/*",
                ]
            }
        }
    }

  # module.loadbalancer.aws_lb_target_group.blue will be created
  + resource "aws_lb_target_group" "blue" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "staging-blue-tg"
      + name_prefix                        = (known after apply)
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name" = "staging-blue-tg"
        }
      + tags_all                           = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-blue-tg"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
        }
      + target_type                        = "instance"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 60
          + matcher             = "200"
          + path                = "/health/simple"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 30
          + unhealthy_threshold = 5
        }

      + stickiness (known after apply)

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

  # module.loadbalancer.aws_lb_target_group.green will be created
  + resource "aws_lb_target_group" "green" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "staging-green-tg"
      + name_prefix                        = (known after apply)
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name" = "staging-green-tg"
        }
      + tags_all                           = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-green-tg"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
        }
      + target_type                        = "instance"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 60
          + matcher             = "200"
          + path                = "/health/simple"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 30
          + unhealthy_threshold = 5
        }

      + stickiness (known after apply)

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

  # module.loadbalancer.aws_security_group.alb will be created
  + resource "aws_security_group" "alb" {
      + arn                    = (known after apply)
      + description            = "Security group for Application Load Balancer"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow HTTP traffic from internet"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow HTTPS traffic from internet"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = "staging-alb-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "staging-alb-sg"
        }
      + tags_all               = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-alb-sg"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
        }
      + vpc_id                 = (known after apply)
    }

  # module.networking.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-nat-eip"
          + "Project"     = "tf-playground"
        }
      + tags_all             = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-nat-eip"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
        }
      + vpc                  = (known after apply)
    }

  # module.networking.aws_internet_gateway.main will be created
  + resource "aws_internet_gateway" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-igw"
          + "Project"     = "tf-playground"
        }
      + tags_all = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-igw"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
        }
      + vpc_id   = (known after apply)
    }

  # module.networking.aws_nat_gateway.main[0] will be created
  + resource "aws_nat_gateway" "main" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-nat-gateway"
          + "Project"     = "tf-playground"
        }
      + tags_all                           = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-nat-gateway"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
        }
    }

  # module.networking.aws_route_table.private will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + nat_gateway_id             = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-private-rt"
          + "Project"     = "tf-playground"
        }
      + tags_all         = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-private-rt"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
        }
      + vpc_id           = (known after apply)
    }

  # module.networking.aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-public-rt"
          + "Project"     = "tf-playground"
        }
      + tags_all         = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-public-rt"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
        }
      + vpc_id           = (known after apply)
    }

  # module.networking.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.aws_security_group.alb will be created
  + resource "aws_security_group" "alb" {
      + arn                    = (known after apply)
      + description            = "Security group for Application Load Balancer"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTP from anywhere"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTPS from anywhere"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = "staging-alb-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-alb-sg"
          + "Project"     = "tf-playground"
        }
      + tags_all               = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-alb-sg"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
        }
      + vpc_id                 = (known after apply)
    }

  # module.networking.aws_security_group.database will be created
  + resource "aws_security_group" "database" {
      + arn                    = (known after apply)
      + description            = "Security group for RDS database"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "MySQL from web servers"
              + from_port        = 3306
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 3306
            },
        ]
      + name                   = "staging-database-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-database-sg"
          + "Project"     = "tf-playground"
        }
      + tags_all               = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-database-sg"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
        }
      + vpc_id                 = (known after apply)
    }

  # module.networking.aws_security_group.webserver will be created
  + resource "aws_security_group" "webserver" {
      + arn                    = (known after apply)
      + description            = "Security group for web servers"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "HTTP from ALB"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = []
              + description      = "HTTPS from ALB"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = "staging-webserver-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-webserver-sg"
          + "Project"     = "tf-playground"
        }
      + tags_all               = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-webserver-sg"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
        }
      + vpc_id                 = (known after apply)
    }

  # module.networking.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.10.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-private-subnet-1"
          + "Project"     = "tf-playground"
        }
      + tags_all                                       = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-private-subnet-1"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.networking.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.11.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-private-subnet-2"
          + "Project"     = "tf-playground"
        }
      + tags_all                                       = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-private-subnet-2"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.networking.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-public-subnet-1"
          + "Project"     = "tf-playground"
        }
      + tags_all                                       = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-public-subnet-1"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.networking.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-public-subnet-2"
          + "Project"     = "tf-playground"
        }
      + tags_all                                       = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-public-subnet-2"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.networking.aws_vpc.main will be created
  + resource "aws_vpc" "main" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-vpc"
          + "Project"     = "tf-playground"
        }
      + tags_all                             = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-vpc"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
        }
    }

  # module.oidc.aws_iam_role.github_actions will be created
  + resource "aws_iam_role" "github_actions" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:KajiMaster/terraform-playground:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::123324351829:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "github-actions-staging"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "github-actions-role-staging"
          + "Project"     = "tf-playground"
        }
      + tags_all              = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "github-actions-role-staging"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.oidc.aws_iam_role_policy.terraform_permissions will be created
  + resource "aws_iam_role_policy" "terraform_permissions" {
      + id          = (known after apply)
      + name        = "terraform-permissions-staging"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:GetObject",
                          + "s3:PutObject",
                          + "s3:DeleteObject",
                          + "s3:ListBucket",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::tf-playground-state-vexus",
                          + "arn:aws:s3:::tf-playground-state-vexus/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "dynamodb:GetItem",
                          + "dynamodb:PutItem",
                          + "dynamodb:DeleteItem",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dynamodb:us-east-2:*:table/tf-playground-locks"
                    },
                  + {
                      + Action   = [
                          + "ec2:*",
                          + "elasticloadbalancing:*",
                          + "autoscaling:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "rds:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:*",
                          + "elasticloadbalancing:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "iam:GetRole",
                          + "iam:PassRole",
                          + "iam:CreateRole",
                          + "iam:CreatePolicy",
                          + "iam:AttachRolePolicy",
                          + "iam:DetachRolePolicy",
                          + "iam:DeleteRole",
                          + "iam:DeletePolicy",
                          + "iam:DeleteRolePolicy",
                          + "iam:PutRolePolicy",
                          + "iam:TagRole",
                          + "iam:TagPolicy",
                          + "iam:UntagRole",
                          + "iam:UntagPolicy",
                          + "iam:ListRolePolicies",
                          + "iam:GetPolicy",
                          + "iam:GetPolicyVersion",
                          + "iam:ListPolicyVersions",
                          + "iam:ListAttachedRolePolicies",
                          + "iam:GetRolePolicy",
                          + "iam:ListInstanceProfilesForRole",
                          + "iam:CreateInstanceProfile",
                          + "iam:DeleteInstanceProfile",
                          + "iam:GetInstanceProfile",
                          + "iam:AddRoleToInstanceProfile",
                          + "iam:RemoveRoleFromInstanceProfile",
                          + "iam:TagInstanceProfile",
                          + "iam:UntagInstanceProfile",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:iam::*:role/tf-playground-*",
                          + "arn:aws:iam::*:role/github-actions-*",
                          + "arn:aws:iam::*:role/staging-*",
                          + "arn:aws:iam::*:role/dev-*",
                          + "arn:aws:iam::*:role/prod-*",
                          + "arn:aws:iam::*:role/production-*",
                          + "arn:aws:iam::*:policy/tf-playground-*",
                          + "arn:aws:iam::*:policy/staging-*",
                          + "arn:aws:iam::*:policy/dev-*",
                          + "arn:aws:iam::*:policy/prod-*",
                          + "arn:aws:iam::*:policy/production-*",
                          + "arn:aws:iam::*:instance-profile/staging-*",
                          + "arn:aws:iam::*:instance-profile/dev-*",
                          + "arn:aws:iam::*:instance-profile/prod-*",
                          + "arn:aws:iam::*:instance-profile/production-*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "iam:ListOpenIDConnectProviders",
                          + "iam:GetOpenIDConnectProvider",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "kms:Decrypt",
                          + "kms:DescribeKey",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "secretsmanager:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ssm:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "cloudwatch:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.secrets.aws_secretsmanager_secret.db_credentials[0] will be created
  + resource "aws_secretsmanager_secret" "db_credentials" {
      + arn                            = (known after apply)
      + description                    = "Database credentials for staging environment"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = (known after apply)
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + tags                           = (known after apply)
      + tags_all                       = (known after apply)

      + replica (known after apply)
    }

  # module.secrets.aws_secretsmanager_secret_version.db_credentials[0] will be created
  + resource "aws_secretsmanager_secret_version" "db_credentials" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + secret_string_wo     = (write-only attribute)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # module.secrets.random_password.db_password[0] will be created
  + resource "random_password" "db_password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.secrets.random_string.suffix[0] will be created
  + resource "random_string" "suffix" {
      + id          = (known after apply)
      + length      = 4
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.ssm.aws_iam_policy.ssm_automation will be created
  + resource "aws_iam_policy" "ssm_automation" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy for SSM automation execution"
      + id               = (known after apply)
      + name             = "staging-ssm-automation-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-ssm-automation-policy"
          + "Project"     = "tf-playground"
        }
      + tags_all         = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-ssm-automation-policy"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
        }
    }

  # module.ssm.aws_iam_role.ssm_automation will be created
  + resource "aws_iam_role" "ssm_automation" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ssm.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "staging-ssm-automation-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-ssm-automation-role"
          + "Project"     = "tf-playground"
        }
      + tags_all              = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-ssm-automation-role"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.ssm.aws_iam_role_policy_attachment.ssm_automation will be created
  + resource "aws_iam_role_policy_attachment" "ssm_automation" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "staging-ssm-automation-role"
    }

  # module.ssm.aws_ssm_document.database_automation will be created
  + resource "aws_ssm_document" "database_automation" {
      + arn              = (known after apply)
      + content          = <<-EOT
            schemaVersion: '0.3'
            assumeRole: '{{ AutomationAssumeRole }}'
            description: 'Automate database initialization with schema and sample data'
            parameters:
              DatabaseEndpoint:
                type: String
                description: RDS database endpoint
              DatabaseName:
                type: String
                description: Database name
              DatabaseUsername:
                type: String
                description: Database username
              DatabasePassword:
                type: String
                description: Database password
              InstanceId:
                type: String
                description: EC2 instance ID to run commands on
              AutomationAssumeRole:
                type: String
                description: IAM role ARN for automation execution
            mainSteps:
            - name: installDependencies
              action: 'aws:runCommand'
              inputs:
                DocumentName: AWS-RunShellScript
                InstanceIds:
                - '{{ InstanceId }}'
                Parameters:
                  commands:
                  - |
                    #!/bin/bash
                    set -e
                    
                    # Update system packages
                    yum update -y
                    
                    # Install MariaDB client if not already installed
                    if ! command -v mysql &> /dev/null; then
                        yum install -y mariadb1011-client-utils
                    fi
                    
                    echo "Dependencies installed successfully"
            - name: createDatabaseSchema
              action: 'aws:runCommand'
              inputs:
                DocumentName: AWS-RunShellScript
                InstanceIds:
                - '{{ InstanceId }}'
                Parameters:
                  commands:
                  - |
                    #!/bin/bash
                    set -e
                    
                    # Set environment variables to avoid shell escaping issues
                    export DB_HOST="{{ DatabaseEndpoint }}"
                    export DB_USER="{{ DatabaseUsername }}"
                    export DB_PASS="{{ DatabasePassword }}"
                    export DB_NAME="{{ DatabaseName }}"
                    
                    # Create database schema using environment variables
                    mysql -h "$DB_HOST" -u "$DB_USER" -p"$DB_PASS" "$DB_NAME" << 'EOF'
                    CREATE TABLE IF NOT EXISTS contacts (
                        id INT AUTO_INCREMENT PRIMARY KEY,
                        name VARCHAR(100) NOT NULL,
                        email VARCHAR(100) UNIQUE NOT NULL,
                        phone VARCHAR(20),
                        created_at TIMESTAMP DEFAULT CURRENT_TIMESTAMP
                    );
                    EOF
                    
                    echo "Database schema created successfully"
            - name: insertSampleData
              action: 'aws:runCommand'
              inputs:
                DocumentName: AWS-RunShellScript
                InstanceIds:
                - '{{ InstanceId }}'
                Parameters:
                  commands:
                  - |
                    #!/bin/bash
                    set -e
                    
                    # Set environment variables to avoid shell escaping issues
                    export DB_HOST="{{ DatabaseEndpoint }}"
                    export DB_USER="{{ DatabaseUsername }}"
                    export DB_PASS="{{ DatabasePassword }}"
                    export DB_NAME="{{ DatabaseName }}"
                    
                    # Insert sample data using environment variables
                    mysql -h "$DB_HOST" -u "$DB_USER" -p"$DB_PASS" "$DB_NAME" << 'EOF'
                    INSERT IGNORE INTO contacts (name, email, phone) VALUES
                    ('John Doe', 'john.doe@example.com', '+1-555-0101'),
                    ('Jane Smith', 'jane.smith@example.com', '+1-555-0102'),
                    ('Bob Johnson', 'bob.johnson@example.com', '+1-555-0103'),
                    ('Alice Brown', 'alice.brown@example.com', '+1-555-0104'),
                    ('Charlie Wilson', 'charlie.wilson@example.com', '+1-555-0105');
                    EOF
                    
                    echo "Sample data inserted successfully"
            - name: verifyDatabaseSetup
              action: 'aws:runCommand'
              inputs:
                DocumentName: AWS-RunShellScript
                InstanceIds:
                - '{{ InstanceId }}'
                Parameters:
                  commands:
                  - |
                    #!/bin/bash
                    set -e
                    
                    # Set environment variables to avoid shell escaping issues
                    export DB_HOST="{{ DatabaseEndpoint }}"
                    export DB_USER="{{ DatabaseUsername }}"
                    export DB_PASS="{{ DatabasePassword }}"
                    export DB_NAME="{{ DatabaseName }}"
                    
                    # Verify the setup using environment variables
                    COUNT=$(mysql -h "$DB_HOST" -u "$DB_USER" -p"$DB_PASS" "$DB_NAME" -s -N -e "SELECT COUNT(*) FROM contacts;")
                    echo "Database setup complete. Found $COUNT contacts in the database."
        EOT
      + created_date     = (known after apply)
      + default_version  = (known after apply)
      + description      = (known after apply)
      + document_format  = "YAML"
      + document_type    = "Automation"
      + document_version = (known after apply)
      + hash             = (known after apply)
      + hash_type        = (known after apply)
      + id               = (known after apply)
      + latest_version   = (known after apply)
      + name             = "staging-database-automation"
      + owner            = (known after apply)
      + parameter        = (known after apply)
      + platform_types   = (known after apply)
      + schema_version   = (known after apply)
      + status           = (known after apply)
      + tags             = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-database-automation-doc"
          + "Project"     = "tf-playground"
        }
      + tags_all         = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-database-automation-doc"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
        }
    }

Plan: 61 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + alb_dns_name              = (known after apply)
  + alb_url                   = (known after apply)
  + alb_zone_id               = (known after apply)
  + application_url           = (known after apply)
  + blue_asg_id               = (known after apply)
  + blue_asg_name             = "staging-blue-asg"
  + blue_target_group_arn     = (known after apply)
  + database_endpoint         = (known after apply)
  + database_name             = "tfplayground"
  + database_port             = (known after apply)
  + deployment_timestamp      = "Deployed via GitFlow CI/CD - $(date)"
  + deployment_validation_url = (known after apply)
  + environment_summary       = {
      + alb_dns_name      = (known after apply)
      + application_url   = (known after apply)
      + blue_asg_name     = "staging-blue-asg"
      + database_endpoint = (known after apply)
      + environment       = "staging"
      + green_asg_name    = "staging-green-asg"
      + region            = "us-east-2"
      + vpc_id            = (known after apply)
    }
  + green_asg_id              = (known after apply)
  + green_asg_name            = "staging-green-asg"
  + green_target_group_arn    = (known after apply)
  + health_check_url          = (known after apply)
  + http_listener_arn         = (known after apply)
  + private_subnet_ids        = [
      + (known after apply),
      + (known after apply),
    ]
  + public_subnet_ids         = [
      + (known after apply),
      + (known after apply),
    ]
  + random_suffix             = (known after apply)
  + secret_arn                = (known after apply)
  + secret_name               = (known after apply)
  + ssm_automation_name       = "staging-database-automation"
  + ssm_automation_role_arn   = (known after apply)
  + vpc_id                    = (known after apply)

  ```
  
  </details>